{
    // NOTE: the recommended character length per line is 80.
    // NOTE: each entry within Contents will automatically add a newline when parsed by DSMS.
    
    "Entries" : [
        {
            "Title": "Tutorial: Adding a Treasure Chest <Elden Ring>",
            "Tags": [
                "Tutorial",
                "Elden Ring", "ER"
            ],
            "Contents": [
                "The following is basic guide on what you need to edit when adding a Treasure Chest",
                "to Elden Ring.",
                "",
                "--- Glossary ---",
                "Letters between the < and > symbols means you need to replace those",
                "letters with suitable numbers based on the map ID.",
                "",
                "XX means the first set of 2 digits of the map",
                "YY means the second set of 2 digits of the map",
                "ZZ means the third set of 2 digits of the map",
                "",
                "For m60 maps, the XX is 10",
                "[-----]",
                "--- Map Objects to Add ---",
                "Asset: a target asset to hold the treasure, typically AEG099_630, the chest model.",
                "Treasure: setup the treasure.",
                "ObjAct: handles the chest interaction.",
                "",
                "It is recommended you duplicate an existing entry and then edit it,",
                "rather that create a new entry via the Create menu.",
                "[-----]",
                "--- Treasure ---",
                "Add a new Treasure map object.",
                "",
                "Change the following properties:",
                "EventID: this number needs to be unique.",
                "PartName: needs to be the name of the Collision or MapPiece the chest is on.",
                "TreasurePartName: needs to be the Name of the chest Asset, e.g. AEG099_630_9000.",
                "ItemLotID: needs to be the the ItemLotParam_map row id you intend to use.",
                "InChest: needs to be 1.",
                "StartDisabled: needs to be 1.",
                "[-----]",
                "--- ObjAct ---",
                "Add a new ObjAct map object.",
                "",
                "EventID: this number needs to be unique.",
                "PartName: needs to be the Name of the Collision or MapPiece the chest is on.",
                "ObjActEntityID: change to <XXYY>3250.",
                "ObjActPartName: needs to be the Name of the chest Asset object.",
                "ObjActID: should be 200 (this is the default chest ObjAct)",
                "StateType: needs to be 5",
                "EventFlag: change to <XXYY>8250",
                "[-----]",
                "--- Asset ---",
                "Add a new Asset map object.",
                "",
                "Name: needs to be a unique Name.",
                "UnkPartNames[]: needs to be the Name of the Collision that the Asset is on.",
                "EntityID: change to <XXYY>1250"
            ]
        }
    ]
}