{
    "Title": "Map Editor: Region",
    "Tags": [
        "Feature"
    ],
    "Contents": [
        "Region map objects that represent areas, either for detection or for placement.",
        "",
        "A simple explanation covering each of the Region map object types.",
        "Note that not all of the types are present within all of the games.",
        "",
        "--- AutoDrawGroupPoint --- ",
        "Unknown.",
        "",
        "--- BuddySummonPoint --- ",
        "A region used to define a summon point for the Spirit Summon system.",
        "Elden Ring only.",
        "",
        "--- Connection --- ",
        "A region used to define a connection between two maps.",
        "",
        "--- Dummy --- ",
        "Unknown.",
        "",
        "--- EnvironmentMapEffectBox --- ",
        "A region used to define an area that applies environmental visual tweaks",
        "when entered by the player.",
        "",
        "--- EnvironmentMapPoint --- ",
        "A region used to define an area that applies environmental visual tweaks",
        "when entered by the player.",
        "",
        "--- EnvironmentMapOutput --- ",
        "A region used to define an area that applies environmental visual tweaks",
        "when entered by the player.",
        "",
        "--- FallPreventionRemoval --- ",
        "A region used to define where fall damage prevention is disabled.",
        "Elden Ring only",
        "",
        "--- FastTravelRestriction --- ",
        "A region used to define where fast travel is disabled.",
        "Elden Ring only",
        "",
        "--- GroupDefeatReward --- ",
        "A region used to define an area in which a enemy group will reward the player.",
        "Elden Ring only",
        "",
        "--- HorseRideOverride --- ",
        "A region used to define an area where horse riding is enabled or disabled.",
        "Elden Ring only",
        "",
        "--- Hitset --- ",
        "A region used to define the hitset for an area.",
        "",
        "--- InvasionPoint --- ",
        "A region used to define an area where an invader may appear.",
        "",
        "--- MapPoint --- ",
        "A region used to define a point that appears on the in-game map.",
        "Elden Ring only",
        "",
        "--- MapPointDiscoveryOverride --- ",
        "A region used to define an area that replaces the normal discovery area",
        "used for a map point.",
        "",
        "--- MapPointParticipationOverride --- ",
        "Unknown.",
        "",
        "--- MapNameOverride --- ",
        "A region used to define an area in which the popup map name message is replaced.",
        "",
        "--- Message --- ",
        "A region used to define a point where a in-game message appears on the ground.",
        "",
        "--- MountJump --- ",
        "A region used to define where a Spiritspring jump may occur.",
        "Elden Ring only",
        "",
        "--- MountJumpFall --- ",
        "A region used to define where a Spiritspring jump landing may occur.",
        "This type of landing prevents all fall damage.",
        "Elden Ring only",
        "",
        "--- MufflingBox --- ",
        "A region used to define a box that muffles sound.",
        "",
        "--- MufflingPlane --- ",
        "A region used to define a plane that muffles sound.",
        "",
        "--- MufflingPortal --- ",
        "A region used to define an area that muffles sound.",
        "",
        "--- NavmeshCutting --- ",
        "A region used to define an area where the navigation mesh can be cut.",
        "",
        "--- NPCArea --- ",
        "Unknown.",
        "",
        "--- Other --- ",
        "A region used to define an area used for detection or placement.",
        "",
        "--- PatrolRoute --- ",
        "A region used to define a point used within a PatrolInfo event object.",
        "",
        "--- PlayArea --- ",
        "A region used to define an area used to setup the Play Region for a map.",
        "Play Regions control various multiplayer attributes.",
        "",
        "--- SFX --- ",
        "A region used to define a point that can playback visual effects.",
        "",
        "--- Sound --- ",
        "A region used to define a point that can emit sound.",
        "",
        "--- SoundRegion --- ",
        "A region used to define an area that can emit sound.",
        "",
        "--- SpawnPoint --- ",
        "A region used to define a point that is used for player respawning.",
        "",
        "--- WeatherCreateAssetPoint --- ",
        "Unknown.",
        "Elden Ring only",
        "",
        "--- WeatherOverride --- ",
        "A region used to define an area that overrides the current weather for the map.",
        "Elden Ring only",
        "",
        "--- WindArea --- ",
        "A region used to define an area that applies wind physics to any cloth-enabled models.",
        "",
        "--- WindSFX --- ",
        "A region used to define an area for wind visuals.",
        ""
    ]
}