{
    "ProjectType": 0,
	"HeaderColor": [ 0.0, 1.0, 0.0, 1.0 ],
	"HighlightColor": [ 0.871, 0.843, 0.351, 1.0 ],
	"Title": "Param Editor: Search",
    "Tags": [
        "Feature",
        "Param"
    ],
    "Contents": [
        "[Header]Information",
        "The param editor searchbars utilise Regex, and words surrounded by ! in commands indicate that a Regex expression may be used instead of plain text.",
        "All other words in capitals are parameters for the given command.",
        "Regex searches are case-insensitive and the searched term may appear anywhere in the target rows.",
        "To specify an exact match, surround the text with ^ and $ (eg. ^10$) or use a range variant.",
        "Multiple selectors can be given by separating them with &&.",
        "Row selection is done through any of the following:",
        "   !VALUE!: to select rows with a matching ID or a matching name",
        "   modified: to select rows changed from vanilla",
        "   original: to select unmodified rows",
        "   id !VALUE!: to select rows with a matching ID",
        "   idrange MIN MAX: to select rows with an ID within the given bounds",
        "   name !NAME!: to select rows with a matching name",
        "   prop FIELD !VALUE!: to select rows who have a matching value for the given field",
        "   proprange FIELD MIN MAX: to select rows who have a value for the given field",
        "   within the given bounds",
        "   propref FIELD !NAME!: to select rows that have a reference to another row",
        "   with a matching name.",
        "[Header]Examples",
        "A complete search may look like the following examples:",
        "id 10000",
        "   This searches for all rows with an id containing 10000.",
        "   This includes 10000, 1000010, 210000",
        "name Dagger",
        "   This searches for all rows with a name containing Dagger.",
        "   This includes Blood Dagger, Sharp daggers and daggerfall",
        "propref originEquipWep0 Dagger",
        "   This searches for all rows whose field originEquipWep0 refers",
        "   to a row with a name containing Dagger, following the same rules above.",
        "name Dagger && idrange 10000 Infinity",
        "   This searches for all rows with a name containing Dagger",
        "   and that have an id greater than 9999)",
        ""
    ]
}