{
    "ProjectType": 0,
	"HeaderColor": [ 0.0, 1.0, 0.0, 1.0 ],
	"HighlightColor": [ 0.871, 0.843, 0.351, 1.0 ],
	"Title": "Operation Arguments",
    "Tags": [
        ""
    ],
    "Contents": [
        "[Header]self",
        "Gives the value of the currently selected value.",
        "[Header]field <field>",
        "Gives the value of the given cell/field for the currently selected row and param",
        "[Header]vanilla",
        "Gives the value of the equivalent cell/field in the vanilla regulation or parambnd for the currently selected cell/field, row and param. Will fail if a row does not have a vanilla equivalent.",
        "[Header]aux <parambank>",
        "Gives the value of the equivalent cell/field in the specified regulation or parambnd for the currently selected cell/field, row and param. Will fail if a row does not have a aux equivalent.",
        "Consider using && !added",
        "[Header]vanillafield <field>",
        "Gives the value of the specified cell/field in the vanilla regulation or parambnd for the currently selected cell/field, row and param. Will fail if a row does not have a vanilla equivalent.",
        "Consider using && !added",
        "[Header]auxfield <parambank> <field>",
        "Gives the value of the specified cell/field in the aux regulation or parambnd for the currently selected cell/field, row and param. Will fail if a row does not have an aux equivilent.",
        "Consider using && !added",
        "[Header]paramlookup <param> <row> <field>",
        "Returns the specific value specified by the exact param, row and field.",
        "[Header]average <field> <row selector>",
        "Gives the mean value of the cells/fields found using the given selector, for the currently selected param.",
        "[Header]median <field> <row selector>",
        "Gives the median value of the cells/fields found using the given selector, for the currently selected param",
        "[Header]mode <field> <row selector>",
        "Gives the mode value of the cells/fields found using the given selector, for the currently selected param.",
        "[Header]min <field> <row selector>",
        "Gives the smallest value of the cells/fields found using the given selector, for the currently selected param.",
        "[Header]max <field> <row selector>",
        "Gives the largest value of the cells/fields found using the given selector, for the currently selected param",
        "[Header]random <min> <max>",
        "Gives a random decimal number between the given values for each selected value. Minimum and maximum are inclusive.",
        "[Header]randint <min> <max>",
        "Gives a random integer number between the given values for each selected value. Minimum and maximum are inclusive.",
        "[Header]randFrom <param> <field> <row selector>",
        "Gives a random value from the cells/fields found using the given param, row selector and field, for each selected value.",
        "[Header]paramIndex",
        "Gives an integer for the current selected param, beginning at 0 and increasing by 1 for each param selected.",
        "[Header]rowIndex",
        "Gives an integer for the current selected row, beginning at 0 and increasing by 1 for each row selected.",
        "[Header]fieldIndex",
        "Gives an integer for the current selected field, beginning at 0 and increasing by 1 for each field selected.",
        ""
    ]
}