{
    "ProjectType": 0,
	"HeaderColor": [ 0.0, 1.0, 0.0, 1.0 ],
	"HighlightColor": [ 0.871, 0.843, 0.351, 1.0 ],
	"Title": "Row Selectors",
    "Tags": [
        ""
    ],
    "Contents": [
        "[Header]selection:",
        "Selects the current param selection and selected rows in that param.",
        "[Header]clipboard:",
        "Selects the param of the clipboard and the rows in the clipboard.",
        "[Header]modified:",
        "Selects rows which do not match the vanilla version, or are added. Ignores row name.",
        "[Header]added:",
        "Selects rows where the ID is not found in the vanilla param.",
        "[Header]id: <string>",
        "Selects rows whose ID matches the given regex.",
        "[Header]idrange: <min> <max>",
        "Selects rows whose ID falls in the given numerical range. Minimum and maximum are inclusive.",
        "[Header]name: <string>",
        "Selects rows whose Name matches the given regex.",
        "[Header]prop: <string> <value>",
        "Selects rows where the specified field has a value that matches the given regex.",
        "[Header]proprange: <string> <min> <max>",
        "Selects rows where the specified field has a value that falls in the given numerical range. Minimum and maximum are inclusive.",
        "[Header]propref: <field> <name>",
        "Selects rows where the specified field that references another param has a value referencing a row whose name matches the given regex.",
        "[Header]propwhere: <field> <selector>",
        "Selects rows where the specified field appears when the given cell or field search is given",
        "[Header]mergeable:",
        "Selects rows which are not modified in the primary regulation or parambnd and there is exactly one equivalent row in another regulation or parambnd that is modified.",
        "[Header]conflicts:",
        "Selects rows which, among all equivalents in the primary and additional regulations or parambnds, there is more than 1 row which is modified",
        "[Header]fmg: <string>",
        "Selects rows which have an attached FMG and that FMG's text matches the given regex.",
        "[Header]vanillaprop: <field> <value>",
        "Selects rows where the vanilla equivilent of that row has a value for the given field that matches the given regex",
        "[Header]vanillaproprange: <string> <min> <max>",
        "Selects rows where the vanilla equivilent of that row has a value for the given field that falls in the given numerical range",
        "[Header]auxprop: <parambank> <field> <value>",
        "Selects rows where the equivilent of that row in the given regulation or parambnd has a value for the given field that matches the given regex. Can be used to determine if an aux row exists.",
        "[Header]auxproprange: <parambank> <field> <min> <max>",
        "Selects rows where the equivilent of that row in the given regulation or parambnd has a value for the given field that falls in the given range",
        "[Header]semijoin: <field> <parambank> <field> <row selector>",
        "Selects all rows where the value of a given field is any of the values in the second given field found in the given param using the given row selector.",
        "[Header]unique: <field>",
        "Selects all rows where the value in the given field is unique.",
        "[Header]vars: <string>",
        "Selects variables whose name matches the given regex.",
        ""
    ]
}